update diagrams to use mermaid syntax
Signed-off-by: Billie Simmons <49491949+JillieBeanSim@users.noreply.github.com>
